{
    // This is a JSON5 file, it uses JSON syntax but supports comments.
    // It also supports trailing commas, so don't worry about them!

    // As part of Meowfetch's limitless customisability, you can create your own widgets.
    // Beware: Widgets execute code, make sure you know what the code will do.

    // Meowfetch is not responsible for any damage you, or someone else cause using custom widgets!
    // Meowfetch will try to stop infinite loops, so dont use them!

    // To make a widget work, you can write it as if each line were a line of input to the python REPL.
    // The first line of the output of the last statement's return will be used, or the widget's local variables.
    // A widget may cause issues with Meowfetch if it takes too long to execute, or errors.
    "widgets":{
        "time":[
            "import time", // Import the python `time` module
            "'Time: '+time.ctime()" // The current formatted time
        ],
        "hello":[
            "'Hello, world!'" // A simple hello world message
        ]
    },

    // The order in which to display widgets.
    "layout":[
        "hello",
        "time"
    ],

    /////////// ASCII ART CONFIGURATION ///////////
    "display_ascii": true, // If false, the rest of this section will be ignored.
    "ascii_location": "top", // Valid values are "top", "bottom", and "left".

    // If false, the value of `ascii` should be a list of lines of text to use.
    // If true, the value of `ascii` should be a string, containing the path to a file to use, any plaintext file will work, extensions are ignored.
    "get_ascii_from_file": false,
    // If you define the ascii here, you need to escape backslashes and single or double quotes by using a backslash before it.
    // Example: `\` should become `\\`, and `"` should become `\"`.
    "ascii":[
        "___  ___                    __     _       _     ",
        "|  \\/  |                   / _|   | |     | |    ",
        "| .  . | ___  _____      _| |_ ___| |_ ___| |__  ",
        "| |\\/| |/ _ \\/ _ \ \ /\ / /  _/ _ \ __/ __| '_ \ ",
        "| |  | |  __/ (_) \ V  V /| ||  __/ || (__| | | |",
        "\_|  |_/\___|\___/ \_/\_/ |_| \___|\__\___|_| |_|",
        "Meowfetch - A terminal fetch utility for cats and humans alike!",
        ""
    ],
}
